{
    "breadcrumb": {
      "category": "Blog",
      "title": "How to Progressive Overload in the Gym"
    },
    "title": "How to Progressive Overload in the Gym",
    "author": "Sam Kotecha",
    "intro": "Ready to take your strength to the next level? Progressive overload is the key to consistent gains and long-term results. In this guide, we’ll break down what progressive overload really means, why it’s essential for building muscle and strength, and how to apply it to your workouts effectively. Let’s dive into the science of getting stronger, one rep at a time.",
    "coverImage": "ProgImg",
    "sections": [
      {
        "type": "section",
        "heading": "What even is Progressive Overloading?!",
        "content": [
          "Progressive overloading is a technique that involves increasing the intensity of your routine compared to the last session. This usually means increasing the weight/reps for each exercise as a way to “progressively overload” your muscles.",
          "This technique allows you to overcome plateaus and continually get stronger as time goes on. The idea is to make the session harder than last time, causing your muscles to adapt to the new resistance you are placing.",
          "Progressive overloading isn’t limited to strength training. This principle can be applied to all forms of exercise, including running and swimming. You may be wondering about the science of exactly how this all works, let’s dive into that next(or you can skip and see how gymskii can help you progressive overload more effectively)."
        ]
      },
      {
        "type": "section",
        "heading": "How Does Progressive Overloading Work Behind the Scenes?",
        "content": [
          "Before we dive into Progressive Overload, we need to understand how our body builds muscle. When we workout our muscle fibers experience microscopic tears which cause our body to repair and reinforce these fibers. This process is known as “muscle protein synthesis”.",
          "Now that we understand how muscle fibers repair and grow, we can now dive into progressive overload. For muscles to continue growing and adapting, they need to face new challenges. If every session we use the same weight, perform the same amount of repetitions etc, our muscles have no reason to grow and adapt. Progressively overloading gives our muscles the stimulus they need to rebuild and strengthen the muscle fibers.",
          "It’s as simple as that, every time you go into a new session, challenge yourself harder in order to force new muscle tears and repairs. Remember to make these increases gradual in order to be safe and not injure yourself!"
        ]
      },
      {
        "type": "tips",
        "heading": "Different Ways of Progressive Overloading",
        "tips": [
          {
            "title": "Increase Volume",
            "steps": [
              "Week 1: Perform 5-8 reps of a Bicep Curl at X weight",
              "Week 2: Perform 8-12 reps of a Bicep Curl at X weight",
              "Week 3: Perform 12-15 reps of a Bicep Curl at X weight",
              "In this example, the weight stays the same but the reps gradually increase weekly"
            ]
          },
          {
            "title": "Increase Weight",
            "steps": [
              "Week 1: Perform Bicep Curls with 10-12 lb dumbbells",
              "Week 2: Perform Bicep Curls with 12-15 lb dumbbells",
              "Week 3: Perform Bicep Curls with 15-18 lb dumbbells",
              "In this example, you are gradually increasing the weight instead of reps"
            ]
          }
        ]
      }
    ]
  }
  