{
    "breadcrumb": {
      "category": "Blog",
      "title": "How much protein do I really need?"
    },
    "title": "How much protein do I really need?",
    "author": "Sam Kotecha",
    "intro": "Not only do you have to train hard, you also have to have a certain diet to achieve your personalized fitness goals. If muscle building is a priority, you’ll need to eat the right amount of protein to build and maintain mass. One question, how much do you really need? With controversy across the internet of how much one should consume, we’ll dive deep in this article to find out a good number.",
    "coverImage": "ProgImg",
    "sections": [
      {
        "type": "section",
        "heading": "Science of protein and muscle",
        "content": [
          "Protein can be found in every cell in tissue in the human body and it is made up of smaller units called amino acids. Amino acids are known as the building blocks of protein, as they help form the structure of our muscles and organs. Protein plays a big part in both the repair and maintenance of muscle tissue, as it provides the necessary amino acids for muscle recovery and growth after exercise. Protein is also essential for the production of enzymes and hormones that regulate various bodily functions, making it a crucial component for overall health and well-being",
          "When we workout, our muscles undergo small tears due to the load we put on them. When we consume protein, we are giving our body the necessary amino acids to rebuild these micro-tears in our muscles. During this process, they are healed stronger, a process known as hypertrophy. Without sufficient protein, the muscle repair and growth process is compromised, leading to slower progress in strength and muscle gains."
        ]
      },
      {
        "type": "section",
        "heading": "So, how much do I need?",
        "content": [
          "The amount of protein an individual needs is based on a lot of factors, including age, health status, and activity level. With that in mind, the RDA(Recommended Dietary Allowance) for protein is about .8g of protein per kg, or .36g per lb. This number is the amount required to maintain nitrogen balance and prevent muscle loss.",
          "This means a person who weighs 180 lbs should be eating around 65g of protein per day, not a lot right?",
          "Well, if one wishes to build muscle, the ration may be higher. How much you may be asking? Let’s reference some studies and learn in the next section"
        ]
      }
    ]
  }
  